<a href="https://colab.research.google.com/github/19PA1A0282/AI-Lab/blob/master/Exp_2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Experiment : 2 Pandas

# **Pandas** is well suited for many different kinds of data:
1. Tabular form with heterogeneously-typed columns.
2. Ordered and unordered time series data.
3. Arbitary matrix data (homogeneously typed or hetrogeneous ) with row and column labels.

## 1) Create a dataframe manually

In [ ]:
# let's see a program to create data frame manually...
import pandas as pd
import numpy as np

### a) Create a dataframe from lists

In [18]:
# Let's write a program for different ways of importing a dataframe 
import pandas as pd
df=pd.DataFrame([["11PA1A0501","ARIGELA AVINASH","M"],["11PA1A0502","BALADARI KEERTHANA","F"]],columns=["Roll No","Name","Gender"])
df

      Roll No                Name Gender
0  11PA1A0501     ARIGELA AVINASH      M
1  11PA1A0502  BALADARI KEERTHANA      F

### b) Create a dataframe by using index

In [19]:
# Let's get the dataframe elements by using index
import pandas as pd
df=pd.DataFrame({"Rollno":["11PA1A0504","11PA1A0505","11PA1A0506"],"Name":["BAVIRISETTI PRAVALIKA","BODDU SAI BABA","BONDAPALLI SRINIVAS"]},index=[2,3,4])
df

       Rollno                   Name
2  11PA1A0504  BAVIRISETTI PRAVALIKA
3  11PA1A0505         BODDU SAI BABA
4  11PA1A0506    BONDAPALLI SRINIVAS

### c) Create a datafarme from dictionaries

In [20]:
# Let's get the dataframe from dictionaries
import pandas as pd
df=pd.DataFrame({"Rollno":["11PA1A0501","11PA1A0502"],"Name":["ARIGELA AVINASH","BALADARI KEERTHANA"]})
df

       Rollno                Name
0  11PA1A0501     ARIGELA AVINASH
1  11PA1A0502  BALADARI KEERTHANA

## 2) Import data into a dataframe

In [22]:
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [23]:
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [24]:
df.describe()

          Roll No  SSC Percentage  ...  B.Tech_percentage    Backlogs
count  117.000000      116.000000  ...         117.000000  117.000000
mean    59.000000       80.474569  ...          62.943419    4.111111
std     33.919021        8.836079  ...          12.064306    6.335148
min      1.000000       47.800000  ...          31.200000    0.000000
25%     30.000000       76.622500  ...          54.180000    0.000000
50%     59.000000       82.745000  ...          64.360000    0.000000
75%     88.000000       87.025000  ...          72.570000    7.000000
max    117.000000       93.660000  ...          88.100000   25.000000

[8 rows x 5 columns]

## 3) Adding, Deleting , Modifying the rows/columns in a dataframe.

###3.1) Adding a column in a dataframe

In [10]:
# Let's write a program for adding a column in a dataframe
import pandas as pd
host_day=pd.read_csv("hostlers_day_scholars.csv")
host_day

    hostler/days scholar
0                      d
1                      d
2                      d
3                      d
4                      h
..                   ...
112                    h
113                    h
114                    h
115                    h
116                    d

[117 rows x 1 columns]

In [11]:
host_day.shape

(117, 1)

In [25]:
df["hostlers/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostlers/days scholar
0        1      M  ...       Not placed                      d
1        2      F  ...           Placed                      d
2        3      F  ...       Not placed                      d
3        4      M  ...       Not placed                      d
4        5      M  ...       Not placed                      h

[5 rows x 10 columns]

###3.2) Deleting a column in a dataframe

In [30]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

###3.3) Adding a row in a dataframe

In [37]:
#Let's create a dataframe with her details
df1=pd.DataFrame({'Roll No': [118], 'Gender': ["F"],'Section': ["C"],"SSC Percentage" :[98.4],'inter_Diploma_percentage':[99],'B.Tech_percentage':[75],'Backlogs':[0], 'placement status':["Not placed"],"hostlers/days scholar":["h"]},index=[117])
df1

     Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
117      118      F       C  ...         0        Not placed                      h

[1 rows x 9 columns]

In [38]:
# Let's write a program to append the data
import pandas as pd
df=df.append(df1)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

###3.4)  Deletion of rows from a dataframe

In [39]:
#Let's write a program for deletion the rows in a dataframe
df=df.drop(2)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

### 3.5) Modifying the elements in a dataframe

In [40]:
#Let's write a program for modifying the elements in a dataframe
import pandas as pd
df.loc[1, 'hostler/days scholar']="h"
df.head()

   Roll No Gender  ... hostlers/days scholar  hostler/days scholar
0        1      M  ...                     d                   NaN
1        2      F  ...                     d                     h
3        4      M  ...                     d                   NaN
4        5      M  ...                     h                   NaN
5        6      M  ...                     h                   NaN

[5 rows x 10 columns]

## 4) Applying functions on a dataframe

In [41]:
# Let's write a program for applying functions on a dataframe
import pandas as pd
def decre(x):
  if(x<70):
    return(x+0.05)
  else:
    return(x)

In [42]:
df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(decre)
df.head()

   Roll No Gender  ... hostlers/days scholar  hostler/days scholar
0        1      M  ...                     d                   NaN
1        2      F  ...                     d                     h
3        4      M  ...                     d                   NaN
4        5      M  ...                     h                   NaN
5        6      M  ...                     h                   NaN

[5 rows x 10 columns]

## 5) Iterations on dataframe

In [43]:
#Let's write a program for iterations on dataframe
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
  print(rows["Roll No"], rows["B.Tech_percentage"])

18 85.39
60 81.1
71 80.47
97 88.1
102 83.38

## 6) Accessing the elements from a dataframe

In [52]:
#Let's write a program for accessing the elements from dataframe
import pandas as pd
df.loc[[0,1],["SSC Percentage", "B.Tech_percentage"]]

   SSC Percentage  B.Tech_percentage
0            87.3              40.05
1            89.0              71.45

## 7) Different Ways to deal with NA's in dataframe

In [55]:
#Let's write a program for different ways to deal with na's in dataframe
import numpy as np
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender  ... hostlers/days scholar  hostler/days scholar
0        1      M  ...                     d                   NaN
1        2      F  ...                     d                     h
3        4      M  ...                     d                   NaN
4        5      M  ...                     h                   NaN
5        6      M  ...                     h                   NaN

[5 rows x 10 columns]

## 8) Groupby operations on dataframe

In [60]:
#Let's write a program for groupby operations on dataframe
grouped=df.groupby("Gender")
grouped["B.Tech_percentage"].agg(np.mean)

Gender
F    71.822653
M    57.037647
Name: B.Tech_percentage, dtype: float64

## 9) Merging the dataframes

In [61]:
#Let's write a program for merging the dataframes
df2=pd.read_csv("urban_rural.csv")
df.head()

   Roll No Gender  ... hostlers/days scholar  hostler/days scholar
0        1      M  ...                     d                   NaN
1        2      F  ...                     d                     h
3        4      M  ...                     d                   NaN
4        5      M  ...                     h                   NaN
5        6      M  ...                     h                   NaN

[5 rows x 10 columns]

In [62]:
df=pd.merge(df,df2,on='Roll No')
df.head()

   Roll No Gender  ... hostler/days scholar  Urban/Rural
0        1      M  ...                  NaN        Urban
1        2      F  ...                    h        Rural
2        4      M  ...                  NaN        Urban
3        5      M  ...                  NaN        Urban
4        6      M  ...                  NaN        Rural

[5 rows x 11 columns]